import Navbar from "../components/Navbar";
import FactCard from "../components/FactCard";

export default function Facts() {
  return (
    <>
      <Navbar />

      <section className="px-8 py-16 max-w-6xl mx-auto">
        <h2 className="text-3xl font-bold mb-10">
          🔭 रोचक स्पेस फैक्ट्स
        </h2>

        <div className="grid md:grid-cols-3 gap-8">
          <FactCard
            title="ब्लैक होल और समय"
            text="ब्लैक होल के पास समय इतना धीमा हो जाता है कि बाहर से देखने पर चीजें कभी गिरती ही नहीं दिखतीं।"
          />

          <FactCard
            title="अंधेरा अंतरिक्ष"
            text="अंतरिक्ष पूरी तरह काला नहीं है। वहाँ गैस और ऊर्जा की हल्की चमक हर जगह फैली हुई है।"
          />

          <FactCard
            title="ब्रह्मांड का अंत?"
            text="वैज्ञानिक आज भी नहीं जानते कि ब्रह्मांड हमेशा फैलता रहेगा या एक दिन समाप्त हो जाएगा।"
          />
        </div>
      </section>
    </>
  );
}
